import clsx from "clsx";

import styles from "./payment-and-delivery.module.scss";

export default function PaymentAndDelivery() {
  return (
    <div className={styles.payment}>
      <div className={styles.payment__container}>
        <section className={styles.payment__section}>
          <p className={styles.payment__title}>ОПЛАТА</p>
          <p className={styles.payment__text2}>Оплатити замовлення можна наступними способами:</p>
          <p className={clsx(styles.payment__subtitle, styles.margin__top20)}>
            1 Оплата післяплатою
          </p>

          <div className={styles.payment__list}>
            <p className={styles.payment__text}>
              При отриманні посилки на "Новій Пошті", а також " Укрпошти". Цей спосіб зручний тим, у
              кого відсутні банківські карти або немає можливості на здійснення оплати через банк.
            </p>
            <p className={styles.payment__text}>Оплата карткою онлайн системою Privat24.</p>
            <p className={styles.payment__text}>
              Мінімальна сума замовлення для після оплати 500, 00 грн. Всі замовлення до 500,00 грн
              100% оплачуються на карту.
            </p>
          </div>
          <p className={styles.payment__subtitle}>2 Оплата карткою онлайн системою Privat24</p>
          <p className={styles.payment__subtitle}>3 Грошовий переказ на картковий рахунок</p>
          <p className={styles.payment__text}>
            Переконливо просимо після того, як вами буде здійснена оплата замовлення, повідомити про
            це нашому менеджеру в телефонному режимі вказавши також ваші контактні дані (ПІБ,
            адреса), точну суму переказу і час оплати. Ця інформація допоможе нам безпомилково і
            вчасно сформувати замовлення і організувати його доставку.
          </p>
          <p className={styles.payment__subtitle}>4 Плата за безготівковим розрахунком</p>
          <p className={styles.payment__text}>
            Оплата за безготівковим розрахунком провадиться в касі відділення будь-якого банку або з
            розрахункового рахунку Вашої фірми. При виборі безготівкового способу оплати доставка
            замовлення можлива після надходження коштів на наш розрахунковий рахунок.
          </p>
          <p className={styles.payment__select}>Мінімальна сума замовлення складає 500 грн.</p>
        </section>
        <section className={styles.payment__section}>
          <p className={styles.payment__title}>ДОСТАВКА</p>
          <p className={styles.payment__select}>
            Час доставки становить в середньому 1-3 робочих дні з моменту відправки, а у віддалені
            регіони-до 7 діб.
          </p>
          <p className={styles.payment__select}>Доставка Укрпоштою до 10 днів</p>
          <br />
          <p className={styles.payment__text2}>Способи доставки:</p>
          <ul className={styles.payment__ul}>
            <li>Доставка "Самовивіз"</li>
            <li>Доставка кур'єром по всій Україні (від дверей до дверей)</li>
            <li>Доставка "Нова Пошта"</li>
            <li>Доставка "Укрпошта"</li>
          </ul>
          <div className={styles.payment__list}>
            <p className={styles.payment__text}>
              В Україні функціонують понад тисячу відділень "Нової пошти." При оформленні замовлення
              клієнт вказує номер найбільш підходящого відділення.
            </p>
            <p className={styles.payment__text}>
              Перевірити статус вашого замовлення можна по товарно-транспортної накладної можна на
              сайтах вантажоперевізників або ж зателефонувавши їм на гарячу лінію.
            </p>
            <p className={styles.payment__text}>
              Вартість доставки замовлення визначається тарифами вантажоперевізника і сплачується
              при отриманні посилки.
            </p>
            <p className={styles.payment__text}>
              При прибутті товару на склад клієнт отримує відповідне sms-повідомлення. Зверніть
              увагу, що після доставки на склад вантажоперевізника ваше замовлення буде безкоштовно
              зберігатися у відділенні «Нової Пошти» не більше 5-ти днів, в Укрпошті - не більше 10
              днів. За закінчення цього терміну товар автоматично, без повідомлення одержувача,
              повертається відправнику.
            </p>
            <p className={styles.payment__text}>
              Для отримання замовлення клієнта необхідно пред'явити паспорт або водійське
              посвідчення, а також вказати номер декларації (з sms-повідомлення, яке прийде на ваш
              номер телефону). Якщо ви не можете особисто отримати замовлення, то це може зробити
              ваше довірена особа. Для цього йому необхідно пред'явити свій і ваш паспорт. Бажано
              також повідомити дані нового одержувача нашого менеджера.
            </p>
            <p className={styles.payment__text}>
              Увага! Нагадуємо: якщо вами обраний "накладений" спосіб оплати, то при отриманні
              замовлення клієнт оплачує транспортні послуги плюс вартість товару ( за накладний
              платіж на Новій Пошті Ви сплачуєте 20 грн+2% від суми замовлення){" "}
              <span id="return"></span>
            </p>
          </div>
        </section>
        <section className={styles.payment__section}>
          <p className={styles.payment__title}>ПОВЕРНЕННЯ</p>
          <div className={styles.payment__list}>
            <p className={styles.payment__text}>
              Компанія здійснює повернення та обмін товарів належної якості згідно Закону{" "}
              <a
                className={styles.payment__select}
                href="https://zakon.rada.gov.ua/laws/show/1023-12#Text"
                target="_blank"
                rel="noopener noreferrer"
              >
                «Про захист прав споживачів»
              </a>
              . Обмін та повернення товарів здійснюється поштовою компанією "Нова пошта"
            </p>
            <p className={styles.payment__text}>
              Для вирішення питань обміну та повернення товарів - зателефонуйте нашому менеджеру за
              номером +380675350585.
            </p>

            <p className={styles.payment__text}>
              <span className={styles.payment__text_bold}>Строки повернення і обміну</span>
              <br /> Повернення та обмін товарів можливий протягом
              <span className={styles.payment__text_bold}> 14 днів</span> після отримання товару
              покупцем. <br />
              <span className={styles.payment__text_bold}>Зворотня доставка товарів </span>
              здійснюється за домовленістю.
            </p>
            <div>
              <p className={styles.payment__text}>
                <span className={styles.payment__text_bold}>
                  Умови повернення для товарів належної якості:
                </span>
              </p>
              <p className={styles.payment__text}>
                Відповідно до статті 9 Закону України «Про захист прав споживачів» існує дві причини
                через які покупець може повернути або обміняти куплений ним товар:
              </p>
              <ul className={styles.payment__ul_number}>
                <li>якщо товар не відповідає якості про яку заявляв виробник;</li>
                <li>
                  якщо товар повністю відповідає всім вимогам, але з якоїсь причини не влаштовує
                  покупця.
                </li>
              </ul>
              <p className={styles.payment__text}>
                Повернення здійснюється використовуючи транспортні послуги компанії "Нова Пошта".
              </p>
              <p className={styles.payment__text}>
                Повернення повинно бути належної якості, а саме:
              </p>
              <ul className={styles.payment__ul_dash}>
                <li>товарна упаковка не пошкоджена </li>
                <li>комплектація повна</li>
                <li>відсутні будь-які механічні пошкодження</li>
                <li>відсутні сліди користування</li>
              </ul>
              <p className={styles.payment__text}>
                Повернення відправлення можливо здійснити впродовж 14 днів з моменту отримання.
                <br />
                Повернення здійснюється за рахунок Відправника.
                <br />
                <span className={styles.payment__text_bold}>Повернення коштів</span> здійснюється
                зручним для клієнта способом протягом 3-х робочих днів після отримання та перевірки
                продавцем товару.
              </p>
            </div>
            <div>
              <p className={styles.payment__text}>
                <span className={styles.payment__text_bold}>
                  Умови повернення товарів неналежної якості:
                </span>
                <br />
                Згідно статті 8 Закону України «Про захист прав споживачів» у разі виявлення
                протягом встановленого гарантійного строку недоліків споживач, в порядку та в
                строки, встановлені законодавством, має право вимагати:
              </p>
              <ul className={styles.payment__ul_dash}>
                <li>пропорційного зменшення ціни;</li>
                <li>безоплатного усунення недоліків товару;</li>
                <li>відшкодування витрат на усунення недоліків товару.</li>
                <li>
                  при виявлені недоліків товару які не підлягають ремонту, Клієнт може запросити
                  заміну товару або ж повернення коштів Інформування про отримання товару неналежної
                  якості повинно бути виконано в перші 24 години після отримання товару Клієнтом
                  телефонним дзвінком, повідомленням на електронну пошту diplomat@gmail.com , або в
                  мессенджері Viber по номеру телефону +380675350585. Вимоги споживача, передбачені
                  цією статтею, не підлягають втіленню, якщо продавець, виробник (підприємство, що
                  задовольняє вимоги споживача, встановлені частиною першою цієї статті) доведуть,
                  що недоліки товару виникли внаслідок порушення споживачем правил користування
                  товаром або його зберігання. Споживач має право брати участь у перевірці якості
                  товару особисто або через свого представника. Повернення здійснюється за рахунок
                  Отримувача.
                </li>
              </ul>
              <p className={styles.payment__text}>
                <span className={styles.payment__text_bold}>Повернення коштів</span> здійснюється
                зручним для клієнта способом протягом 3-х робочих днів після отримання та перевірки
                продавцем товару.
              </p>
            </div>
            <p className={styles.payment__text}>
              Згідно із Законом{" "}
              <a
                className={styles.payment__select}
                href="https://zakon.rada.gov.ua/laws/show/1023-12#Text"
                target="_blank"
                rel="noopener noreferrer"
              >
                «Про захист прав споживачів»
              </a>
              , компанія може відмовити споживачеві в обміні та поверненні товарів належної якості,
              якщо вони відносяться до категорій, що зазначені у чинному{" "}
              <a
                className={styles.payment__select}
                href="https://zakon.rada.gov.ua/laws/show/172-94-%D0%BF#Text"
                target="_blank"
                rel="noopener noreferrer"
              >
                Переліку непродовольчих товарів належної якості, не підлягають поверненню та обміну
              </a>
              .
            </p>
          </div>
        </section>
      </div>
    </div>
  );
}
